In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame(
    {"a" : [4, 5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = [1,2,3])

In [4]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
df[["b","c"]]

   b   c
1  7  10
2  8  11
3  9  12

In [7]:
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [8]:
df.loc[1,"b"]

7

In [9]:
df.loc[[2,3]]

   a  b   c
2  5  8  11
3  6  9  12

In [10]:
s = pd.Series([1,3,5,np.nan,6,8])

In [11]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range('20130101', periods=6)

In [13]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [15]:
df

                   A         B         C         D
2013-01-01  0.112792  1.629800  0.139071  0.820783
2013-01-02  0.379264 -0.370015 -0.457571 -0.547396
2013-01-03 -1.938471  0.727516  0.781586  0.408016
2013-01-04  1.922389  0.400473  0.477910  0.799574
2013-01-05  0.114304  0.556708  1.282775 -0.002675
2013-01-06  1.055765  0.803614  1.842967  2.242461